zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54114J256UK49-pinctrl.h
/*
 * NOTE: File generated by lpc_cfg_utils.py
 * from LPC54114J256UK49/signal_configuration.xml
 *
 * Copyright (c) 2022, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on LPC54114J256BD64-pinctrl.h with this part's differences applied
 * below (378 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 4ecc77b5d9f05235
 */

#ifndef _ZEPHYR_DTS_BINDING_LPC54114J256UK49_WRAPPER_
#define _ZEPHYR_DTS_BINDING_LPC54114J256UK49_WRAPPER_

#include "LPC54114J256BD64-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_TRIG0_PIO0_2
#undef ADC0_TRIG0_PIO0_3
#undef ADC0_TRIG0_PIO1_10
#undef ADC0_TRIG0_PIO1_11
#undef ADC0_TRIG0_PIO1_12
#undef ADC0_TRIG0_PIO1_13
#undef ADC0_TRIG0_PIO1_14
#undef ADC0_TRIG0_PIO1_15
#undef ADC0_TRIG0_PIO1_16
#undef ADC0_TRIG0_PIO1_17
#undef ADC0_TRIG0_PIO1_9
#undef ADC0_TRIG1_PIO0_2
#undef ADC0_TRIG1_PIO0_3
#undef ADC0_TRIG1_PIO1_10
#undef ADC0_TRIG1_PIO1_11
#undef ADC0_TRIG1_PIO1_12
#undef ADC0_TRIG1_PIO1_13
#undef ADC0_TRIG1_PIO1_14
#undef ADC0_TRIG1_PIO1_15
#undef ADC0_TRIG1_PIO1_16
#undef ADC0_TRIG1_PIO1_17
#undef ADC0_TRIG1_PIO1_9
#undef CTIMER0_CAPTURE0_PIO1_16
#undef CTIMER0_CAPTURE2_PIO1_9
#undef CTIMER0_MATCH0_PIO1_16
#undef CTIMER1_CAPTURE0_PIO1_11
#undef CTIMER1_CAPTURE3_PIO1_15
#undef CTIMER1_MATCH0_PIO1_12
#undef CTIMER1_MATCH1_PIO1_13
#undef CTIMER1_MATCH3_PIO0_3
#undef CTIMER2_CAPTURE1_PIO0_2
#undef DMA0_TRIG0_PIO0_2
#undef DMA0_TRIG0_PIO0_3
#undef DMA0_TRIG0_PIO1_10
#undef DMA0_TRIG0_PIO1_11
#undef DMA0_TRIG0_PIO1_12
#undef DMA0_TRIG0_PIO1_13
#undef DMA0_TRIG0_PIO1_14
#undef DMA0_TRIG0_PIO1_15
#undef DMA0_TRIG0_PIO1_16
#undef DMA0_TRIG0_PIO1_17
#undef DMA0_TRIG0_PIO1_9
#undef DMA0_TRIG10_PIO0_2
#undef DMA0_TRIG10_PIO0_3
#undef DMA0_TRIG10_PIO1_10
#undef DMA0_TRIG10_PIO1_11
#undef DMA0_TRIG10_PIO1_12
#undef DMA0_TRIG10_PIO1_13
#undef DMA0_TRIG10_PIO1_14
#undef DMA0_TRIG10_PIO1_15
#undef DMA0_TRIG10_PIO1_16
#undef DMA0_TRIG10_PIO1_17
#undef DMA0_TRIG10_PIO1_9
#undef DMA0_TRIG11_PIO0_2
#undef DMA0_TRIG11_PIO0_3
#undef DMA0_TRIG11_PIO1_10
#undef DMA0_TRIG11_PIO1_11
#undef DMA0_TRIG11_PIO1_12
#undef DMA0_TRIG11_PIO1_13
#undef DMA0_TRIG11_PIO1_14
#undef DMA0_TRIG11_PIO1_15
#undef DMA0_TRIG11_PIO1_16
#undef DMA0_TRIG11_PIO1_17
#undef DMA0_TRIG11_PIO1_9
#undef DMA0_TRIG12_PIO0_2
#undef DMA0_TRIG12_PIO0_3
#undef DMA0_TRIG12_PIO1_10
#undef DMA0_TRIG12_PIO1_11
#undef DMA0_TRIG12_PIO1_12
#undef DMA0_TRIG12_PIO1_13
#undef DMA0_TRIG12_PIO1_14
#undef DMA0_TRIG12_PIO1_15
#undef DMA0_TRIG12_PIO1_16
#undef DMA0_TRIG12_PIO1_17
#undef DMA0_TRIG12_PIO1_9
#undef DMA0_TRIG13_PIO0_2
#undef DMA0_TRIG13_PIO0_3
#undef DMA0_TRIG13_PIO1_10
#undef DMA0_TRIG13_PIO1_11
#undef DMA0_TRIG13_PIO1_12
#undef DMA0_TRIG13_PIO1_13
#undef DMA0_TRIG13_PIO1_14
#undef DMA0_TRIG13_PIO1_15
#undef DMA0_TRIG13_PIO1_16
#undef DMA0_TRIG13_PIO1_17
#undef DMA0_TRIG13_PIO1_9
#undef DMA0_TRIG14_PIO0_2
#undef DMA0_TRIG14_PIO0_3
#undef DMA0_TRIG14_PIO1_10
#undef DMA0_TRIG14_PIO1_11
#undef DMA0_TRIG14_PIO1_12
#undef DMA0_TRIG14_PIO1_13
#undef DMA0_TRIG14_PIO1_14
#undef DMA0_TRIG14_PIO1_15
#undef DMA0_TRIG14_PIO1_16
#undef DMA0_TRIG14_PIO1_17
#undef DMA0_TRIG14_PIO1_9
#undef DMA0_TRIG15_PIO0_2
#undef DMA0_TRIG15_PIO0_3
#undef DMA0_TRIG15_PIO1_10
#undef DMA0_TRIG15_PIO1_11
#undef DMA0_TRIG15_PIO1_12
#undef DMA0_TRIG15_PIO1_13
#undef DMA0_TRIG15_PIO1_14
#undef DMA0_TRIG15_PIO1_15
#undef DMA0_TRIG15_PIO1_16
#undef DMA0_TRIG15_PIO1_17
#undef DMA0_TRIG15_PIO1_9
#undef DMA0_TRIG16_PIO0_2
#undef DMA0_TRIG16_PIO0_3
#undef DMA0_TRIG16_PIO1_10
#undef DMA0_TRIG16_PIO1_11
#undef DMA0_TRIG16_PIO1_12
#undef DMA0_TRIG16_PIO1_13
#undef DMA0_TRIG16_PIO1_14
#undef DMA0_TRIG16_PIO1_15
#undef DMA0_TRIG16_PIO1_16
#undef DMA0_TRIG16_PIO1_17
#undef DMA0_TRIG16_PIO1_9
#undef DMA0_TRIG17_PIO0_2
#undef DMA0_TRIG17_PIO0_3
#undef DMA0_TRIG17_PIO1_10
#undef DMA0_TRIG17_PIO1_11
#undef DMA0_TRIG17_PIO1_12
#undef DMA0_TRIG17_PIO1_13
#undef DMA0_TRIG17_PIO1_14
#undef DMA0_TRIG17_PIO1_15
#undef DMA0_TRIG17_PIO1_16
#undef DMA0_TRIG17_PIO1_17
#undef DMA0_TRIG17_PIO1_9
#undef DMA0_TRIG18_PIO0_2
#undef DMA0_TRIG18_PIO0_3
#undef DMA0_TRIG18_PIO1_10
#undef DMA0_TRIG18_PIO1_11
#undef DMA0_TRIG18_PIO1_12
#undef DMA0_TRIG18_PIO1_13
#undef DMA0_TRIG18_PIO1_14
#undef DMA0_TRIG18_PIO1_15
#undef DMA0_TRIG18_PIO1_16
#undef DMA0_TRIG18_PIO1_17
#undef DMA0_TRIG18_PIO1_9
#undef DMA0_TRIG19_PIO0_2
#undef DMA0_TRIG19_PIO0_3
#undef DMA0_TRIG19_PIO1_10
#undef DMA0_TRIG19_PIO1_11
#undef DMA0_TRIG19_PIO1_12
#undef DMA0_TRIG19_PIO1_13
#undef DMA0_TRIG19_PIO1_14
#undef DMA0_TRIG19_PIO1_15
#undef DMA0_TRIG19_PIO1_16
#undef DMA0_TRIG19_PIO1_17
#undef DMA0_TRIG19_PIO1_9
#undef DMA0_TRIG1_PIO0_2
#undef DMA0_TRIG1_PIO0_3
#undef DMA0_TRIG1_PIO1_10
#undef DMA0_TRIG1_PIO1_11
#undef DMA0_TRIG1_PIO1_12
#undef DMA0_TRIG1_PIO1_13
#undef DMA0_TRIG1_PIO1_14
#undef DMA0_TRIG1_PIO1_15
#undef DMA0_TRIG1_PIO1_16
#undef DMA0_TRIG1_PIO1_17
#undef DMA0_TRIG1_PIO1_9
#undef DMA0_TRIG2_PIO0_2
#undef DMA0_TRIG2_PIO0_3
#undef DMA0_TRIG2_PIO1_10
#undef DMA0_TRIG2_PIO1_11
#undef DMA0_TRIG2_PIO1_12
#undef DMA0_TRIG2_PIO1_13
#undef DMA0_TRIG2_PIO1_14
#undef DMA0_TRIG2_PIO1_15
#undef DMA0_TRIG2_PIO1_16
#undef DMA0_TRIG2_PIO1_17
#undef DMA0_TRIG2_PIO1_9
#undef DMA0_TRIG3_PIO0_2
#undef DMA0_TRIG3_PIO0_3
#undef DMA0_TRIG3_PIO1_10
#undef DMA0_TRIG3_PIO1_11
#undef DMA0_TRIG3_PIO1_12
#undef DMA0_TRIG3_PIO1_13
#undef DMA0_TRIG3_PIO1_14
#undef DMA0_TRIG3_PIO1_15
#undef DMA0_TRIG3_PIO1_16
#undef DMA0_TRIG3_PIO1_17
#undef DMA0_TRIG3_PIO1_9
#undef DMA0_TRIG4_PIO0_2
#undef DMA0_TRIG4_PIO0_3
#undef DMA0_TRIG4_PIO1_10
#undef DMA0_TRIG4_PIO1_11
#undef DMA0_TRIG4_PIO1_12
#undef DMA0_TRIG4_PIO1_13
#undef DMA0_TRIG4_PIO1_14
#undef DMA0_TRIG4_PIO1_15
#undef DMA0_TRIG4_PIO1_16
#undef DMA0_TRIG4_PIO1_17
#undef DMA0_TRIG4_PIO1_9
#undef DMA0_TRIG5_PIO0_2
#undef DMA0_TRIG5_PIO0_3
#undef DMA0_TRIG5_PIO1_10
#undef DMA0_TRIG5_PIO1_11
#undef DMA0_TRIG5_PIO1_12
#undef DMA0_TRIG5_PIO1_13
#undef DMA0_TRIG5_PIO1_14
#undef DMA0_TRIG5_PIO1_15
#undef DMA0_TRIG5_PIO1_16
#undef DMA0_TRIG5_PIO1_17
#undef DMA0_TRIG5_PIO1_9
#undef DMA0_TRIG6_PIO0_2
#undef DMA0_TRIG6_PIO0_3
#undef DMA0_TRIG6_PIO1_10
#undef DMA0_TRIG6_PIO1_11
#undef DMA0_TRIG6_PIO1_12
#undef DMA0_TRIG6_PIO1_13
#undef DMA0_TRIG6_PIO1_14
#undef DMA0_TRIG6_PIO1_15
#undef DMA0_TRIG6_PIO1_16
#undef DMA0_TRIG6_PIO1_17
#undef DMA0_TRIG6_PIO1_9
#undef DMA0_TRIG7_PIO0_2
#undef DMA0_TRIG7_PIO0_3
#undef DMA0_TRIG7_PIO1_10
#undef DMA0_TRIG7_PIO1_11
#undef DMA0_TRIG7_PIO1_12
#undef DMA0_TRIG7_PIO1_13
#undef DMA0_TRIG7_PIO1_14
#undef DMA0_TRIG7_PIO1_15
#undef DMA0_TRIG7_PIO1_16
#undef DMA0_TRIG7_PIO1_17
#undef DMA0_TRIG7_PIO1_9
#undef DMA0_TRIG8_PIO0_2
#undef DMA0_TRIG8_PIO0_3
#undef DMA0_TRIG8_PIO1_10
#undef DMA0_TRIG8_PIO1_11
#undef DMA0_TRIG8_PIO1_12
#undef DMA0_TRIG8_PIO1_13
#undef DMA0_TRIG8_PIO1_14
#undef DMA0_TRIG8_PIO1_15
#undef DMA0_TRIG8_PIO1_16
#undef DMA0_TRIG8_PIO1_17
#undef DMA0_TRIG8_PIO1_9
#undef DMA0_TRIG9_PIO0_2
#undef DMA0_TRIG9_PIO0_3
#undef DMA0_TRIG9_PIO1_10
#undef DMA0_TRIG9_PIO1_11
#undef DMA0_TRIG9_PIO1_12
#undef DMA0_TRIG9_PIO1_13
#undef DMA0_TRIG9_PIO1_14
#undef DMA0_TRIG9_PIO1_15
#undef DMA0_TRIG9_PIO1_16
#undef DMA0_TRIG9_PIO1_17
#undef DMA0_TRIG9_PIO1_9
#undef DMIC0_CLK0_PIO1_15
#undef DMIC0_DATA0_PIO1_16
#undef FC0_CTS_SDA_SSEL0_PIO0_2
#undef FC0_RTS_SCL_SSEL1_PIO0_3
#undef FC1_SCK_PIO1_10
#undef FC2_RXD_SDA_MOSI_PIO1_14
#undef FC2_SSEL2_PIO0_3
#undef FC2_SSEL3_PIO0_2
#undef FC3_RXD_SDA_MOSI_PIO1_9
#undef FC4_SCK_PIO1_11
#undef FC5_RXD_SDA_MOSI_PIO1_12
#undef FC5_TXD_SCL_MISO_PIO1_13
#undef FC6_RTS_SCL_SSEL1_PIO1_11
#undef FC6_TXD_SCL_MISO_WS_PIO1_10
#undef FC7_CTS_SDA_SSEL0_PIO1_15
#undef FC7_RTS_SCL_SSEL1_PIO1_16
#undef FC7_RXD_SDA_MOSI_DATA_PIO1_13
#undef FC7_SCK_PIO1_12
#undef FC7_TXD_SCL_MISO_WS_PIO1_14
#undef GPIO_PIO02_PIO0_2
#undef GPIO_PIO03_PIO0_3
#undef GPIO_PIO110_PIO1_10
#undef GPIO_PIO111_PIO1_11
#undef GPIO_PIO112_PIO1_12
#undef GPIO_PIO113_PIO1_13
#undef GPIO_PIO114_PIO1_14
#undef GPIO_PIO115_PIO1_15
#undef GPIO_PIO116_PIO1_16
#undef GPIO_PIO117_PIO1_17
#undef GPIO_PIO19_PIO1_9
#undef MCLK_PIO1_17
#undef PINT_PINT0_PIO0_2
#undef PINT_PINT0_PIO0_3
#undef PINT_PINT0_PIO1_10
#undef PINT_PINT0_PIO1_11
#undef PINT_PINT0_PIO1_12
#undef PINT_PINT0_PIO1_13
#undef PINT_PINT0_PIO1_14
#undef PINT_PINT0_PIO1_15
#undef PINT_PINT0_PIO1_16
#undef PINT_PINT0_PIO1_17
#undef PINT_PINT0_PIO1_9
#undef PINT_PINT1_PIO0_2
#undef PINT_PINT1_PIO0_3
#undef PINT_PINT1_PIO1_10
#undef PINT_PINT1_PIO1_11
#undef PINT_PINT1_PIO1_12
#undef PINT_PINT1_PIO1_13
#undef PINT_PINT1_PIO1_14
#undef PINT_PINT1_PIO1_15
#undef PINT_PINT1_PIO1_16
#undef PINT_PINT1_PIO1_17
#undef PINT_PINT1_PIO1_9
#undef PINT_PINT2_PIO0_2
#undef PINT_PINT2_PIO0_3
#undef PINT_PINT2_PIO1_10
#undef PINT_PINT2_PIO1_11
#undef PINT_PINT2_PIO1_12
#undef PINT_PINT2_PIO1_13
#undef PINT_PINT2_PIO1_14
#undef PINT_PINT2_PIO1_15
#undef PINT_PINT2_PIO1_16
#undef PINT_PINT2_PIO1_17
#undef PINT_PINT2_PIO1_9
#undef PINT_PINT3_PIO0_2
#undef PINT_PINT3_PIO0_3
#undef PINT_PINT3_PIO1_10
#undef PINT_PINT3_PIO1_11
#undef PINT_PINT3_PIO1_12
#undef PINT_PINT3_PIO1_13
#undef PINT_PINT3_PIO1_14
#undef PINT_PINT3_PIO1_15
#undef PINT_PINT3_PIO1_16
#undef PINT_PINT3_PIO1_17
#undef PINT_PINT3_PIO1_9
#undef PINT_PINT4_PIO0_2
#undef PINT_PINT4_PIO0_3
#undef PINT_PINT4_PIO1_10
#undef PINT_PINT4_PIO1_11
#undef PINT_PINT4_PIO1_12
#undef PINT_PINT4_PIO1_13
#undef PINT_PINT4_PIO1_14
#undef PINT_PINT4_PIO1_15
#undef PINT_PINT4_PIO1_16
#undef PINT_PINT4_PIO1_17
#undef PINT_PINT4_PIO1_9
#undef PINT_PINT5_PIO0_2
#undef PINT_PINT5_PIO0_3
#undef PINT_PINT5_PIO1_10
#undef PINT_PINT5_PIO1_11
#undef PINT_PINT5_PIO1_12
#undef PINT_PINT5_PIO1_13
#undef PINT_PINT5_PIO1_14
#undef PINT_PINT5_PIO1_15
#undef PINT_PINT5_PIO1_16
#undef PINT_PINT5_PIO1_17
#undef PINT_PINT5_PIO1_9
#undef PINT_PINT6_PIO0_2
#undef PINT_PINT6_PIO0_3
#undef PINT_PINT6_PIO1_10
#undef PINT_PINT6_PIO1_11
#undef PINT_PINT6_PIO1_12
#undef PINT_PINT6_PIO1_13
#undef PINT_PINT6_PIO1_14
#undef PINT_PINT6_PIO1_15
#undef PINT_PINT6_PIO1_16
#undef PINT_PINT6_PIO1_17
#undef PINT_PINT6_PIO1_9
#undef PINT_PINT7_PIO0_2
#undef PINT_PINT7_PIO0_3
#undef PINT_PINT7_PIO1_10
#undef PINT_PINT7_PIO1_11
#undef PINT_PINT7_PIO1_12
#undef PINT_PINT7_PIO1_13
#undef PINT_PINT7_PIO1_14
#undef PINT_PINT7_PIO1_15
#undef PINT_PINT7_PIO1_16
#undef PINT_PINT7_PIO1_17
#undef PINT_PINT7_PIO1_9
#undef SCT0_OUT4_PIO1_10
#undef SCT0_OUT5_PIO1_15
#undef SCT0_OUT7_PIO1_14
#undef USB0_FRAME_PIO1_10
#undef USB0_UP_LED_PIO1_9
#undef USB0_VBUS_PIO1_11
#undef UTICK0_CAPTURE2_PIO1_12
#undef UTICK0_CAPTURE3_PIO1_17

#endif /* _ZEPHYR_DTS_BINDING_LPC54114J256UK49_WRAPPER_ */
